package lesson1.homework;

/**
 * Для того чтобы увидеть результат выполнения какой-то операции после запуска вашего приложения - этот результат надо
 * передать в круглые скобки функции System.out.println()
 */
public class Homework1 {
    public static void main(String[] args) {
        // 1. Создайте переменную типа int и присвойте ей любое значение. Затем присвойте этой переменной другое значение

        // ваш код здесь

        // 2. Создайте другую переменную того же типа что и первая переменная и присвойте ей результат сложение первой переменной с каким-нибудь числом

        // ваш код здесь

        // 3. Возведите в квадрат переменную которая получилась во втором задании.(Без использования библиотек)

        // ваш код здесь

        // 4. Составьте из переменных или из литералов или из того и другого какое-инбудь выражение посложнее.
        // Нарпимер формулу расчета окружности. Или просто 2 произвения и одно сложение в одном выражении.(Не забываем про круглые скобки)

        // ваш код здесь

        // 5. Напишите операцию преобразования например 6 часов в секунды.(Результат вывести на консоль)

        // ваш код здесь

        // 6. Cоздайте две переменные и в выражении определите больше ли первая переменная или нет.

        // ваш код здесь

        // 7. Определить в выражении является ли какое-нибудь число четным.

        // ваш код здесь

        // 8. В одном выражении сравните результат выполнения одного произведения и одного вычитания.(Результат вывести на консоль)

        // ваш код здесь


    }
}
